QGDsolver/tutorials/interQHDFoam/2D/uDrop/0.orig/wedge.include
wedge1
{
    type	wedge;
}

wedge2
{
    type	wedge;
}

defaultFaces
{
    type	empty;
}